       IDENTIFICATION DIVISION.
       PROGRAM-ID. ABH005.
       AUTHOR. TCSABH.
       ENVIRONMENT DIVISION.
       SPECIAL-NAMES.
           CONSOLE IS CRT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WA-DATE        PIC 9(08) VALUE ZEROS.
       01 WA-TOTAL       PIC 9(06) VALUE ZEROS.
       01 WA-ERR         PIC X(01) VALUE SPACES.
       01 WA-DAYS.
          05 FILLER      PIC X(09) VALUE "SUNDAY".
          05 FILLER      PIC X(09) VALUE "MONDAY".
          05 FILLER      PIC X(09) VALUE "TUESDAY".
          05 FILLER      PIC X(09) VALUE "WEDNESDAY".
          05 FILLER      PIC X(09) VALUE "THURSDAY".
          05 FILLER      PIC X(09) VALUE "FRIDAY".
          05 FILLER      PIC X(09) VALUE "SATURDAY".
       01 FILLER REDEFINES WA-DAYS.
          05 WA-D-ARR OCCURS 7 TIMES PIC X(09).
       01 WA-Q           PIC 9(04) VALUE ZEROS.
       01 WA-R           PIC 9(01) VALUE ZEROS.
       PROCEDURE DIVISION.
       0000-BEGIN.
           DISPLAY "ENTER DATE :- " AT 1010.
           ACCEPT WA-DATE AT 1025.
           CALL "ABH003" USING WA-DATE WA-ERR.
           CANCEL "ABH003".
           IF (WA-ERR = "*")
              DISPLAY "INVALID DATE " AT 2040
              GO TO 0000-BEGIN.
           CALL "ABH004" USING WA-DATE WA-TOTAL.
           CANCEL "ABH004".
           
           DIVIDE WA-TOTAL BY 7 GIVING WA-Q REMAINDER WA-R.
           ADD 1 TO WA-R.
           DISPLAY "THE DAY IS :- " AT 1210.
           DISPLAY WA-D-ARR(WA-R) AT 1225.
           STOP RUN.
           
